# 7. Data Selection(loc)
Use name then choose row and column you want

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Application Number')
df

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#1,Ian,A1,178,90,100,88,95,Python
#2,Jason,A2,198,100,82,78,88,NaN
#3,Smith,A2,168,85,87,90,75,C++
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN
#6,Daisy,A1,172,91,80,76,80,NaN
#7,Jack,A2,174,77,50,85,100,R
#8,Poppy,A1,180,80,90,70,89,Python

In [2]:
df.loc['#1'] # index #1 data

Name          Ian
School         A1
Height        178
English        90
Math          100
Biology        88
Finance        95
Coding     Python
Name: #1, dtype: object

In [3]:
df.loc[['#1', '#5']]

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#1,Ian,A1,178,90,100,88,95,Python
#5,Kara,A1,201,82,78,88,84,NaN

In [4]:
df.loc['#1', 'Coding'] # Coding of #1

'Python'

In [5]:
df.loc[['#3', '#7'], 'Finance'] # Finance of #3 and #7

Application Number
#3     75
#7    100
Name: Finance, dtype: int64

In [6]:
df.loc[['#4', '#5'], ['English', 'Finance']]

                    English  Finance
Application Number
#4                       70       92
#5                       82       84

In [ ]:
df.loc[]